{
  "name": "Модуль Активатора",
  "category": "modularrouters:modules",
  "icon": "modularrouters:activator_module",
  "pages": [
    {
      "type": "text",
      "text": "Этот мощный модуль действует как $(italic)фейковый игрок/$, который может использовать предмет из буфера маршрутизатора на близлежащих блоках или сущностях. Существует три режима, которые можно выбрать с помощью элементов управления справа в интерфейсе. Каждый режим подробно описан на следующих страницах."
    },
    {
      "type": "text",
      "title": "Правый клик",
      "text": "Этот режим выполняет правый клик предметом из буфера маршрутизатора, так же, как если бы это сделал игрок. Логика используется такая же, как для кликов игрока, например, правый клик $(item)Кремень и сталь/$ по двери откроет дверь, а не подожжёт её.$(p)Целевой блок (если есть) зависит от направления маршрутизатора, направления модуля, а также от настройки модуля Look Above/Below/Level."
    },
    {
      "type": "text",
      "title": "Правый клик по сущности",
      "text": "Этот режим выполняет правый клик предметом из буфера маршрутизатора по близлежащей $(thing)сущности/$. Например, можно использовать для дойки коровы или стрижки овцы.$(p)Это может привести к выпадению предметов на землю, например, если к корове кликнуть стеком более чем одного ведра в буфере маршрутизатора."
    },
    {
      "type": "text",
      "title": "Атака по сущности",
      "text": "Этот режим выполняет левый клик предметом из буфера маршрутизатора по близлежащей $(thing)сущности/$, нанося ей урон. Этот режим по умолчанию потребляет $(l:upgrades/energy)Forge Energy/$, в отличие от других модулей.$(p)Примечание: хотя $(l:upgrades/speed)Улучшения скорости/$ могут быть полезны здесь, кулдауны оружия действуют, поэтому чрезмерное количество Улучшений скорости приведёт лишь к потере энергии и прочности оружия."
    },
    {
      "type": "text",
      "text": "У Активатора дальность действия около 4 блоков, аналогично реальному игроку. Модуль также можно настроить на взгляд $(thing)Вверх/$ или $(thing)Вниз/$ (по умолчанию — $(thing)По уровню/$).$(p)$(thing)Вверх/$ особенно удобно для посадки предметов на твёрдый блок рядом или над маршрутизатором, а $(thing)Вниз/$ полезно, если нужно целиться прямо в землю рядом с маршрутизатором, а не в более удалённый блок."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:activator_module"
    }
  ]
}
