{
  "name": "Экструдер Модуль Mk1",
  "category": "modularrouters:modules",
  "icon": "modularrouters:extruder_module_1",
  "pages": [
    {
      "type": "text",
      "text": "Этот модуль выдвигает и убирает ряд блоков (из буфера маршрутизатора) в направлении, указанном в настройках модуля.$(p)По умолчанию модуль выдвигает блоки, когда маршрутизатор получает сигнал редстоуна, и убирает их, когда сигнала нет. Но в модуль можно добавить $(l:upgrades/redstone)Редстоун-улучшение/$, чтобы настроить это поведение."
    },
    {
      "type": "text",
      "text": "С помощью этого модуля можно строить большие выдвижные мосты и дверные проёмы. (Если вы когда-либо использовали $(italic)Drawbridge/$ из мода Tinker's Mechworks в версии 1.7.10, функционал будет знаком).$(li)Смотрите также $(l:upgrades/camouflage)Улучшение Камуфляжа/$, которое может быть полезно для скрытия маршрутизатора.$(li)Диапазон по умолчанию (т.е. количество блоков, которые можно разместить) — 12, но его можно увеличить до 24 с помощью $(l:augments/range_up)Аугментов Увеличения Диапазона/$."
    },
    {
      "type": "text",
      "text": "$(li)Если изменить направление модуля, пока блоки выдвинуты, маршрутизатор может немного запутаться. В этом случае поможет сломать и заново поставить маршрутизатор.$(li)Если сломать маршрутизатор при выдвинутых блоках, он не запомнит их, и придётся вручную убрать эти блоки."
    },
    {
      "type": "text",
      "text": "$(li)Если у вас несколько маршрутизаторов с установленными Экструдерами (например, для широкой двери или моста), может быть полезно $(l:upgrades/sync)Улучшение Синхронизации/$, чтобы все работали в один тик.$(li)Экструдер (как и $(l:modules/placer)Модуль Размещателя/$) также может сажать семена на фермерской земле и какао-бобы на соседний джунглевый лог."
    },
    {
      "type": "text",
      "text": "Важно отметить, что $(l:modules/breaker)Модуль Ломателя/$, использованный для крафта этого модуля, передаёт свой уровень добычи (и зачарования) Экструдеру. Поэтому, если вы хотите, чтобы ваш Экструдер мог разрушать $(item)Обсидиан/$, обязательно используйте Модуль Ломателя, созданный с $(item)Алмазной Киркой/$!"
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:extruder_module_1"
    }
  ]
}
