{
  "name": "Модуль Жидкостей Mk1",
  "category": "modularrouters:modules",
  "icon": "modularrouters:fluid_module",
  "pages": [
    {
      "type": "text",
      "text": "Хотя маршрутизаторы не могут напрямую работать с жидкостями (у них нет внутреннего бака), они могут управлять жидкостями, если в буфере есть $(italic)один/$ предмет-контейнер с жидкостью. Это могут быть ведра или любые контейнеры, добавленные другими модами."
    },
    {
      "type": "text",
      "text": "GUI Модуля Жидкостей позволяет задавать направление передачи:$(li)$(bold)Передача в маршрутизатор/$ означает, что маршрутизатор будет пытаться забрать жидкость из соседнего блока (будь то жидкость в мире или блок-хранилище жидкости) в предмет-контейнер в буфере.$(li)$(bold)Передача из маршрутизатора/$ означает, что маршрутизатор будет пытаться вылить жидкость из предмета-контейнера в мире — либо вылить в мир, либо поместить жидкость в соседний бак."
    },
    {
      "type": "text",
      "text": "GUI также позволяет задать максимальную скорость передачи. Обратите внимание, что это $(italic)максимум, который будет $(italic)попытан/$, и она всё ещё ограничена общей скоростью передачи маршрутизатора — 1 ведро в секунду — и скоростью передачи внешнего блока или контейнера.$(p)Слоты фильтра Модуля Жидкостей принимают только предметы с жидкостью и фильтруют по содержащейся жидкости, а не по типу контейнера."
    },
    {
      "type": "text",
      "text": "Добавление $(l:upgrades/speed)Ускорителей/$ не увеличивает скорость передачи жидкости, а только частоту проверок. Маршрутизатор с 9 ускорителями всё равно передаст лишь 1 ведро в секунду, просто чаще и меньшими порциями. Чтобы увеличить общую скорость передачи, добавьте $(l:upgrades/fluid)Улучшители Перекачки Жидкостей/$.$(p)Будьте осторожны с настройками Модуля Жидкостей, если в маршрутизаторе находятся опасные жидкости, например, ведро лавы. Маршрутизатор без колебаний выльет лаву, если вы ошибётесь..."
    },
    {
      "type": "text",
      "text": "Также можно подключать жидкостные трубы из других модов к маршрутизатору, $(bold)если/$ в буфере есть предмет-контейнер с жидкостью, и качать жидкости через маршрутизатор; жидкости будут направлены в/из предмета-контейнера.$(p)Для этого $(italic)не/$ требуется установленный Модуль Жидкостей; он нужен только если вы хотите активно вытягивать или закачивать жидкости."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:fluid_module"
    }
  ]
}

