{
  "name": "Ритуалы – Начало работы",
  "icon": "bloodmagic:activationcrystalcreative",
  "category": "bloodmagic:rituals",
  "priority": "true",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Как только вы доведете свой $(l:bloodmagic:altar/blood_altar)Кровавый алтарь$(/l) до уровня 3, вы сможете окунуться в чудесный мир Ритуалов. $(br2)Для работы с ритуалами вам потребуется следующее: $(li)An $(l:bloodmagic:rituals/activation_crystals)Кристалл активации$(). На уровне 3 доступен только $(item)Weak Crystal$(). $(li)A $(item)Мастерский ритуальный камень$(). Каждый ритуал требует наличия именно одного из них в центре."
    },
    {
      "type": "patchouli:text",
      "text": "$(li)Достаточно ритуальных камней для создания Ритуала. $(li)(Рекомендуется) A $(l:bloodmagic:rituals/ritual_diviner)Ritual Diviner$(). Хотя это и не обязательно, это значительно облегчит строительство ритуала. $(br2)Создать ритуал относительно просто. Просто нажмите [$(k:sneak)] + [$(k:use)] с Ритуальным предсказателем в руке, пока не отобразится название желаемого ритуала. Проверьте количество необходимых рун, наведя на него курсор в вашем"
    },
    {
      "type": "patchouli:text",
      "text": "инвентарь и хранение [$(k:sneak)]. $(br2)Поместите главный ритуальный камень и удерживайте [$(k:use)], пока все камни не будут размещены и окрашены правильным элементом. Наконец, нажмите [$(k:use)] на Главном ритуальном камне, держа в руке кристалл активации. Если вы все сделали правильно, вы должны получить сообщение: «Во время ритуала течет прилив энергии!». Ритуал теперь активен."
    },
    {
      "type": "patchouli:text",
      "text": "Если этого не происходит, возможно, что-то пошло не так. Если вместо этого вы получите сообщение: «Вы чувствуете толчок, но слишком слабы, чтобы завершить этот ритуал», значит, в вашей $(thing)Soul Network$() недостаточно $(blood)LP$() для активации ритуала. $(br2)Если сообщение гласит: «Вы чувствуете, что эти руны настроены неправильно...», значит, что-то пошло не так с размещением рун. Проверьте место на наличие засоров и попробуйте провести ритуал еще раз."
    },
    {
      "type": "patchouli:text",
      "text": "Помните, что некоторые ритуалы простираются на несколько блоков выше и ниже главного ритуального камня. Если вы не получили никаких ошибок, убедитесь, что кристалл активации привязан к вашей сети души — это можно сделать, нажав [$(k:use)], удерживая его. $(br2) Важно отметить, что кристалл не обязательно должен быть привязан к ВАШЕЙ сети - если вы сможете завладеть кристаллом другого игрока, вы можете активировать ритуалы, используя его $(blood)LP$(). Берегите свое хорошо!"
    },
    {
      "type": "patchouli:text",
      "text": "последнее замечание; все ритуалы реагируют на сигнал $(fire)redstone$(), поэтому прикрепление рычага сбоку от Главного ритуального камня — хороший способ его деактивировать. Вы можете объединить эти знания с некоторой информацией в $(l:bloodmagic:altar/redstone_automation)Redstone and Automation$(), чтобы гарантировать автоматическое завершение ваших ритуалов задолго до того, как ваша $(thing)Soul Network$() иссякнет."
    }
  ]
}