{
  "name": "Руководство по развитию",
  "icon": "terramity:guiding_moonlight",
  "category": "terramity:overview",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Целью Terramity является продвижение прогресса, поэтому для того, кто не очень хорошо знает мод, может быть сложно сразу же приступить к работе без каких-либо указаний, таково последствие наличия большего количества вещей в моде.$(br2)Однако, не волноваться. Эта глава предназначена для того, чтобы рассказать вам, в каком порядке вам нужно получить вещи."
    },
    {
      "type": "patchouli:spotlight",
      "text": "В конце концов, всем нужен миниган, верно?$(br)Но его не получить сразу, для этого придется потрудиться. На следующей странице вы должны найти график того, в каком порядке следует получать металлы на протяжении прохождения всего мода. Каждый раз, когда металл находится на на одном уровне с другим это означает, что вы можете выбирать тот, который захотите.",
      "item": {
        "item": "terramity:stairway_to_heaven"
      }
    },
    {
      "type": "patchouli:image",
      "title": "График",
      "images": [
        "terramity:textures/screens/the_graph.png"
      ],
      "border": false,
      "text": "      выше\u003dлучше."
    },
    {
      "type": "patchouli:text",
      "text": "Как говорилось на предыдущей странице, если металл находится на одном уровне с другими, то они равносильны. Вы не сможете получить 3 лучших металла, не получив предварительно горящий материал ниже: $(l:terramity:ores/profanum)Профанум$().$(br2)Некоторые материалы могут быть заблокированы боссами, например черный материя, которую можно получить только после победы над Стражем испытаний."
    },
    {
      "type": "patchouli:image",
      "title": "График",
      "images": [
        "terramity:textures/screens/consult_the_graphs.png"
      ],
      "border": true
    },
    {
      "type": "patchouli:spotlight",
      "text": "Если вы не знаете, что делать дальше, проверьте категорию $(l:terramity:bosses)\u0027Боссы\u0027$() этой книги. Боссы расположены сверху вниз, от первого по прогрессии до последнего.",
      "item": {
        "item": "terramity:offering_pedestal"
      }
    }
  ]
}