{
  "block.enigmaticdelicacy.astral_button": "Астральная кнопка",
  "block.enigmaticdelicacy.astral_cabinet": "Астральный шкафчик",
  "block.enigmaticdelicacy.astral_cruet": "Астральный флакон [В разработке]",
  "block.enigmaticdelicacy.astral_door": "Астральная дверь",
  "block.enigmaticdelicacy.astral_fruit": "Висящий небесный плод",
  "block.enigmaticdelicacy.astral_leaves": "Астральные листья",
  "block.enigmaticdelicacy.astral_log": "Астральное бревно",
  "block.enigmaticdelicacy.astral_planks": "Астральные доски",
  "block.enigmaticdelicacy.astral_pressure_plate": "Астральная нажимная пластина",
  "block.enigmaticdelicacy.astral_sapling": "Астральный саженец",
  "block.enigmaticdelicacy.astral_slab": "Астральная плита",
  "block.enigmaticdelicacy.astral_stairs": "Астральная лестница",
  "block.enigmaticdelicacy.astral_trapdoor": "Астральный люк",
  "block.enigmaticdelicacy.astral_wood": "Астральная древесина",
  "block.enigmaticdelicacy.balanced_stewed_soup_block": "Сбалансированное рагу",
  "block.enigmaticdelicacy.blossoming_astral_leaves": "Цветущие астральные листья",
  "block.enigmaticdelicacy.divine_fruit_pie_block": "Божественный фруктовый пирог",
  "block.enigmaticdelicacy.enigmatic_bush": "Загадочный куст",
  "block.enigmaticdelicacy.enigmatic_fruit_crate": "Ящик с загадочными фруктами",
  "block.enigmaticdelicacy.etherium_ore": "Эфириевая руда",
  "block.enigmaticdelicacy.etherium_stove": "Эфириевая плита",
  "block.enigmaticdelicacy.infinisoil": "Инфини-почва",
  "block.enigmaticdelicacy.infinisoil_farmland": "Инфини-пашня",
  "block.enigmaticdelicacy.potted_astral_sapling": "Астральный саженец в горшке",
  "block.enigmaticdelicacy.sticky_pie": "Липкий загадочный пирог",
  "block.enigmaticdelicacy.stripped_astral_log": "Обтесанное астральное бревно",
  "block.enigmaticdelicacy.stripped_astral_wood": "Обтесанная астральная древесина",
  "book.enigmaticdelicacy.category.food.desc": "С какими бы ситуациями вы ни столкнулись, голод всегда будет проблемой.<br2/>Считаете ли вы, что, будучи фундаментальным элементом выживания в этом мире, необходимо также исследовать скрытую в нём силу?<br2/>Наконец, помните, что Бог никогда не обделяет свой желудок.",
  "book.enigmaticdelicacy.category.food.name": "Деликатес",
  "book.enigmaticdelicacy.entry.abyssal_stew.name": "Бездонное рагу",
  "book.enigmaticdelicacy.entry.abyssal_stew.page.1": "Даже столкнувшись с таким причудливым существом из бездны, вы всё равно невольно хотите его попробовать.<br2/>Чтобы избежать неизвестных реакций, вы стараетесь выбирать ингредиенты со схожими свойствами. Однако почему-то результат всё равно тошнотворный — не только цвет, но и аромат.<br2/>После употребления ваше тело",
  "book.enigmaticdelicacy.entry.abyssal_stew.page.2": "значительно усилится, а ваши групповые боевые способности также возрастут. Но похоже, что Сердце Бездны не может быть переварено человеческим телом и по истечении времени будет извергнуто наружу. Можно ли его использовать повторно? Это может быть несколько неудобно.",
  "book.enigmaticdelicacy.entry.astral_fruit_slice.page": "Острыми ножами можно разрезать даже неведомые фрукты. В целом, после разделения кажется, что эту силу можно использовать более эффективно.",
  "book.enigmaticdelicacy.entry.astral_popsicle.page": "Иногда хочется чего-то прохладного, но это кажется слишком холодным? Я больше не чувствую жара.",
  "book.enigmaticdelicacy.entry.astral_tree.blossoming": "Цветение",
  "book.enigmaticdelicacy.entry.astral_tree.building_materials": "Строительство",
  "book.enigmaticdelicacy.entry.astral_tree.materials": "Материалы",
  "book.enigmaticdelicacy.entry.astral_tree.name": "Астральное дерево",
  "book.enigmaticdelicacy.entry.astral_tree.page.1": "Глядя на небесный плод в руке, его вкус всплыл в вашей памяти. Независимо от того, откуда взялось это воспоминание, вы решили сохранить его для дальнейших исследований, чтобы возродить этот деликатес в мире.<br2/>Учитывая, что небесные плоды напоминают яблоки, вы решили использовать дубы в качестве мишени для прививки,",
  "book.enigmaticdelicacy.entry.astral_tree.page.2": "используя астрал и силу Эндера для завершения простой прививки.<br2/>Но обычная почва не позволяет ему расти, и даже богатая почва может заставить его вырасти лишь в маленькие растения, но у вас нет другого выбора.",
  "book.enigmaticdelicacy.entry.astral_tree.page.3": "Небесные плоды требуют длительного процесса цветения и плодоношения, и, как правило, их невозможно ускорить костной мукой, если только у вас нет способности управлять временем.",
  "book.enigmaticdelicacy.entry.astral_tree.page.4": "Помимо бесконечных небесных плодов, астральное дерево также имеет множество практических побочных продуктов, таких как кора и листья. Их можно переработать в еду или аксессуары.",
  "book.enigmaticdelicacy.entry.astral_tree.page.5": "Что касается самой древесины, изделия из астрального дерева более устойчивы, чем обычные деревянные изделия, и их нелегко воспламенить. Помимо эстетики, в них есть и практичность.",
  "book.enigmaticdelicacy.entry.astral_tree.page.6": "Листья, вызывающие ощущение спокойствия, кажутся хорошим ингредиентом для заваривания чая. В сочетании с молоком и медом получается простой, но эффективный успокаивающий чай.<br/>По вкусу он полностью отличается от Космического зелья.",
  "book.enigmaticdelicacy.entry.astral_tree.page.7": "Сверкающая кора содержит много магии, и мы можем использовать Сердце Земли как носитель для усиления его способностей. В отличие от трансформаций других сердец, оно обладает собственным сознанием и использует возобновляемую энергию внутри для защиты своего владельца.",
  "book.enigmaticdelicacy.entry.balanced_stewed_soup.name": "Баланс запретного",
  "book.enigmaticdelicacy.entry.balanced_stewed_soup.page.1": "Кажется жаль полностью отказываться от проклятия запретного плода, но оно действительно блокирует удовольствие от наслаждения едой. В результате исследований появился такой сбалансированный выбор между ними.<br2/>Во время действия эффекта искупления, за исключением ограничений на восстановление здоровья, вы будете чувствовать голод",
  "book.enigmaticdelicacy.entry.balanced_stewed_soup.page.2": "как обычный человек, но, похоже, трудно определить точный уровень голода.<br2/>Кроме того, нет необходимости беспокоиться о расходе супа. Он может восстанавливаться естественным путем, прежде чем будет полностью съеден.",
  "book.enigmaticdelicacy.entry.cosmic_cake.page.3": "Получив эфириевое мачете, вы захотели ощутить его истинные отличия. Столкнувшись с Вечным Тортом, другие ножи охотно поддались, но эфириевое мачете упорствовало до конца.<br2/>Почему мы не можем отрезать последний кусок? Ну, вы думаете, что это, должно быть, какой-то фундаментальный принцип мира.",
  "book.enigmaticdelicacy.entry.curse_blade.crystal_usage": "Использование",
  "book.enigmaticdelicacy.entry.curse_blade.heading": "Противоядие",
  "book.enigmaticdelicacy.entry.curse_blade.name": "Разорванное кольцо",
  "book.enigmaticdelicacy.entry.curse_blade.page.1": "Мы искали способы разорвать Кольцо Семи Проклятий, и вот новая идея.<br2/>Попытка напрямую разорвать физическую связь между Кольцом и телом, хотя цена может быть значительной, несомненно, является наиболее удобным способом. А вот что использовать для «казни» — вопрос фатальный.",
  "book.enigmaticdelicacy.entry.curse_blade.page.2": "Обратите свой взор на странный амулет — Оберег Адского Клинка.<br2/>Что касается предметов с проклятиями и острыми обоюдоострыми краями, мы можем разбить их и использовать два лезвия для этого действия.",
  "book.enigmaticdelicacy.entry.curse_blade.page.3": "Положите пальцы на разделочную доску, и с резким звуком Кольцо Семи Проклятий высвободится. Это сопровождается сильной болью, слегка поврежденным ножом и Проклятым кристаллом души.<br2/>Но теперь вы станете немного счастливее, избавившись от семи проклятий.",
  "book.enigmaticdelicacy.entry.curse_blade.page.4": "Наконец, используя зелье Возврата для спасения всех душ, запертых в Проклятом Кристалле Души, мы действительно можем избежать страданий, вызванных Семью проклятиями.",
  "book.enigmaticdelicacy.entry.curse_blade.page.5": "После всего этого в ваших руках, возможно, еще остались фрагменты души. Почему бы не использовать их для создания уникальных предметов.",
  "book.enigmaticdelicacy.entry.cut": "Нарезать",
  "book.enigmaticdelicacy.entry.divine_fruit_pie.name": "Праздник богов",
  "book.enigmaticdelicacy.entry.divine_fruit_pie.page.1": "Если вы не были крещены Семью проклятиями, то вы не имеете права читать эту запись.<br2/>Небесный плод и Бутылка ихора — никто не может устоять перед их искушением, и вероятность их появления в инвентаре одновременно практически равна нулю. Как вы их обнаружили? Вы полагались на таинственную силу?",
  "book.enigmaticdelicacy.entry.divine_fruit_pie.page.2": "Хотя пирог можно разделить, нет никакой гарантии, что это позволит вам расширить слот для амулетов. Однако вы также можете получить больше слотов.<br2/>Это пари с богами.",
  "book.enigmaticdelicacy.entry.enchantment_duplicator.name": "Фолиант всеведения",
  "book.enigmaticdelicacy.entry.enchantment_duplicator.page.1": "Точно так же «Том жаждущих знаний» по-прежнему вызывает у людей желание постоянно творить и пробовать что-то новое.<br2/>На этот раз он черпает магию из Астрального Дерева, что позволяет ему идеально воспроизводить чары, хранящиеся в предмете, не меняя ни одного из них.",
  "book.enigmaticdelicacy.entry.enchantment_duplicator.page.2": "Конечно, независимо от того, хорошие это чары или плохие, он попытается скопировать их все вместе. Сила Астрального Дерева всё еще слишком чиста.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.name": "Загадочный плод",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.1": "По неизвестной причине эта древняя культура давно исчезла, но ее живучесть позволила ей выжить в виде семян. Возможно, вам стоит попробовать его плоды.<br2/>Пухлые плоды наполнены прозрачным соком, а вкус очень липкий. Как вы думаете, стоит ли их сначала обработать?",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.2": "В различных руинах можно найти эти жуткие темные семена, но кажется, что обычные поля не могут поддержать их рост. Возможно, вам стоит изучить истинный потенциал этой земли.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.3": "После простой обработки кристально чистое желе колышется на тарелке, как слизень, и его вкус становится приятным. Кроме того, после еды вы становитесь прозрачным, что очень выгодно для внезапных атак.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.4": "Этот сладкий вкус может не только утолить жажду, но и значительно усилить ваши способности к самовосстановлению. Возможно, это мощная пища для экстренных случаев.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.5": "Хотя материал выглядит твердым, растворимость крема превосходит воображение. Помимо свежего и нежного вкуса, очень привлекательны постоянные и временные эффекты.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.6": "Яркий цвет и пикантный вкус этой еды обязательно пробудят в вас страсть и еще больше погрузят в напряженные сражения.",
  "book.enigmaticdelicacy.entry.enigmatic_fruit.page.7": "Чтобы лучше передать эффект невидимости, в качестве носителя использовался свиток, намазанный кремом и исписанный загадочным текстом.<br/>Этот свиток может периодически обеспечивать эффекты затухания, позволяя вам лучше скрываться.",
  "book.enigmaticdelicacy.entry.enigmatic_recipes.name": "Загадочные рецепты",
  "book.enigmaticdelicacy.entry.enigmatic_recipes.page": "Используя простые кухонные принадлежности и методы, мы можем подать эти странные материалы к обеденному столу и раскрыть их уникальные эффекты.<br2/>Конечно, мы также обнаружили несколько утерянных рецептов, которые делают больше предметов возобновляемыми.",
  "book.enigmaticdelicacy.entry.enigmatic_seed": "Семена",
  "book.enigmaticdelicacy.entry.etherium_machete.name": "Эфириевое мачете",
  "book.enigmaticdelicacy.entry.etherium_machete.page.1": "Широкое лезвие этого ножа позволяет не только нарезать ингредиенты на кухне, но и превращать живых существ в еду. Хотя оно кажется тяжеловатым, это ничто по сравнению с отличным уроном.<br2/>По сравнению со сбором, боевые навыки кажутся вам более важными.",
  "book.enigmaticdelicacy.entry.etherium_machete.page.2": "подходит для этого инструмента. В отличие от быстрого отступления палаша, здесь необходим радикальный рывок.<br2/>Конечно, использовать ли его для боя или для побега — ваш выбор.",
  "book.enigmaticdelicacy.entry.etherium_stove.name": "Эфириевая плита",
  "book.enigmaticdelicacy.entry.etherium_stove.page.1": "Это «совершенное оружие» на кухне.<br2/>Эфирий отлично проводит тепло к кастрюлям, а звездная пыль служит топливом для мощного источника тепла. По сравнению с традиционными методами, эфириевая плита может почти вдвое сократить время приготовления пищи, значительно",
  "book.enigmaticdelicacy.entry.etherium_stove.page.2": "экономя время на кухне.<br2/>Кроме того, в эту плиту встроен отсек с бесконечным топливом, что позволяет максимально эффективно использовать пространство.",
  "book.enigmaticdelicacy.entry.gluttony_charm.name": "Безграничное чревоугодие",
  "book.enigmaticdelicacy.entry.gluttony_charm.page.1": "Называется чревоугодием, но это не совсем так. После улучшения этот амулет стал еще мощнее мучить ваш желудок.<br2/>Он может усилить жажду еды в вашем сердце и превратить ее в различные силы. Можно потерпеть сейчас ради роскошного банкета после битвы.",
  "book.enigmaticdelicacy.entry.gluttony_charm.page.2": "Кроме того, в бою стремление к чревоугодию иногда переплетается с желанием убивать, создавая больше силы и компенсируя избыток соответствующих желаний.",
  "book.enigmaticdelicacy.entry.harmonious_grail.name": "Гармоничный Грааль",
  "book.enigmaticdelicacy.entry.harmonious_grail.page.1": "Хотя многие знают о мощном эффекте Нечестивого Грааля и Запретного плода, многие не желают жертвовать деликатесами ради этого удовольствия. На стыке этих идей был разработан этот рецепт.<br2/>Положив запретный плод в Грааль и наблюдая,",
  "book.enigmaticdelicacy.entry.harmonious_grail.page.2": "как жидкость постепенно меняет цвет, вы чувствуете, что пора ее попробовать.<br2/>Глотнув густую жидкость и соединив ее с кусочками фруктов на краю Грааля, вы ощутите нежный вкус,",
  "book.enigmaticdelicacy.entry.harmonious_grail.page.3": "который невозможно забыть. Если вы когда-либо пробовали Небесный фрукт, вы наверняка узнаете похожий вкус.",
  "book.enigmaticdelicacy.entry.hungry_charm.name": "Знак самодисциплины",
  "book.enigmaticdelicacy.entry.hungry_charm.page.1": "Идея использовать еду для изготовления амулетов впервые пришла мне в голову. Давайте попробуем.<br2/>Но результат оказался неожиданным. Такой оберег не заставляет наслаждаться едой, а наоборот, заставляет контролировать свой голод.",
  "book.enigmaticdelicacy.entry.hungry_charm.page.2": "А этот аппетитный окорок с золотистой корочкой выглядит еще соблазнительнее. Но пока на вас этот оберег, вам придется сдерживать свои желания.",
  "book.enigmaticdelicacy.entry.ichor_bottle.page": "Теперь вы получили рецепт Бутылки ихора, древней реликвии. Чего вы не ожидали, так это того, что за мощной реликвией скрывается такой простой рецепт.",
  "book.enigmaticdelicacy.entry.ichoroot_soup.page": "Суп из ихорокорня может усилить божественную часть ихора, становясь стабильным источником очищенных эффектов сопротивления.",
  "book.enigmaticdelicacy.entry.infinisoil.name": "Инфини-почва",
  "book.enigmaticdelicacy.entry.infinisoil.page.1": "Что бы это ни было, мы всегда ищем его окончательную форму. Сельскохозяйственные угодья — не исключение.<br2/>Добавьте Сущность бушующей жизни в землю, используя всю силу природы. Эта мерцающая земля будет выращивать культуры с невероятной скоростью без каких-либо затрат, и даже воздействовать на растения, на которые не действует обычное удобрение.",
  "book.enigmaticdelicacy.entry.infinisoil.page.2": "При таком питании некоторые культуры могут принести двойной урожай.<br2/>Обратите внимание, что Эссенция все еще активна, и обычная плодородная почва может дать чудесный побочный эффект.",
  "book.enigmaticdelicacy.entry.purified_dragon_breath.page": "Очищенное дыхание дракона может превратить вас в «ходячее зелье», распространяя эффекты с вашего тела на окружающую среду, как положительные, так и отрицательные.",
  "book.enigmaticdelicacy.entry.redemption_potion.page": "Для Зелья искупления неизбежно требуется сам Запретный плод. Только через него мы можем достичь этой цели, другого пути нет.",
  "book.enigmaticdelicacy.entry.ring": "Кольцо",
  "book.enigmaticdelicacy.entry.stuffed_astral_potato.page": "Разрезав телепортат и добавив плоды коруса в качестве начинки, вы обнаружите, что не только количество увеличилось, но и реакция между ними заставляет Эндер-мобов временно терять способность к телепортации.",
  "book.enigmaticdelicacy.entry.weapon_charm.name": "Слава мастера оружия",
  "book.enigmaticdelicacy.entry.weapon_charm.page.1": "Разное оружие имеет разный стиль боя. В зависимости от ситуации должны быть разные способы его усиления.<br2/>Этот сияющий талисман, созданный из нескольких видов оружия, дает вам разные бонусы в зависимости от того, что у вас в руках.",
  "book.enigmaticdelicacy.entry.weapon_charm.page.2": "Известные улучшения:<br/>Низкая скорость атаки: увеличивает критический урон на <&l>+50%%$ (чистый).<br/>Высокая скорость атаки: цель атаки получает эффект слабости.",
  "commands.enigmaticdelicacy.refreshEffect.success.multiple": "Убраны все постоянные эффекты еды для %1$s сущностей.",
  "commands.enigmaticdelicacy.refreshEffect.success.single": "Удалены все постоянные эффекты еды игрока %1$s.",
  "container.enigmaticdelicacy.etherium_stove": "Эфириевая плита",
  "effect.enigmaticdelicacy.abyss_corruption": "Порча бездны",
  "effect.enigmaticdelicacy.astral_drunkenness": "Звездное опьянение",
  "effect.enigmaticdelicacy.fading": "Затухание",
  "effect.enigmaticdelicacy.health_curse": "Проклятие здоровья",
  "effect.enigmaticdelicacy.perseverance": "Настойчивость",
  "effect.enigmaticdelicacy.redemption": "Искупление",
  "effect.enigmaticdelicacy.xp_boost": "Увеличение опыта",
  "enchantment.enigmaticdelicacy.slicing": "Нарезка",
  "entity.enigmaticdelicacy.etherium_machete": "Эфириевое мачете",
  "item.enigmaticdelicacy.abyssal_stew": "Бездонное рагу",
  "item.enigmaticdelicacy.astral_fruit_slice": "Кусочек небесного плода",
  "item.enigmaticdelicacy.astral_leaf": "Астральный лист",
  "item.enigmaticdelicacy.astral_popsicle": "Астральное эскимо",
  "item.enigmaticdelicacy.astral_tea": "Небесный успокаивающий чай",
  "item.enigmaticdelicacy.balanced_stewed_soup": "Миска сбалансированного рагу",
  "item.enigmaticdelicacy.bloody_custard": "Кровавый пудинг",
  "item.enigmaticdelicacy.broken_cursed_soul_crystal": "Сломанный кристалл проклятой души",
  "item.enigmaticdelicacy.cosmic_cake_slice": "Кусочек вечного торта",
  "item.enigmaticdelicacy.curse_blade": "Проклятый клинок",
  "item.enigmaticdelicacy.curse_crystal_knife": "Нож из кристалла проклятой души",
  "item.enigmaticdelicacy.curse_crystal_pendant": "Кулон из кристалла проклятой души",
  "item.enigmaticdelicacy.curse_crystal_ring": "Кольцо из кристалла проклятой души [НЗП]",
  "item.enigmaticdelicacy.curse_potion": "Проклятое зелье",
  "item.enigmaticdelicacy.cursed_soul_crystal": "Кристалл проклятой души",
  "item.enigmaticdelicacy.cursed_soul_fragment": "Фрагмент кристалла проклятой души",
  "item.enigmaticdelicacy.divine_fruit_pie": "Божественный фруктовый пирог",
  "item.enigmaticdelicacy.enchantment_duplicator": "Фолиант всеведения",
  "item.enigmaticdelicacy.enigmatic_cream": "Загадочный крем",
  "item.enigmaticdelicacy.enigmatic_fruit": "Загадочный плод",
  "item.enigmaticdelicacy.enigmatic_seed": "Загадочные семена",
  "item.enigmaticdelicacy.etherium_machete": "Эфириевое мачете",
  "item.enigmaticdelicacy.etherium_steak": "Эфириевый стейк",
  "item.enigmaticdelicacy.fading_scroll": "Свиток угасания",
  "item.enigmaticdelicacy.glistening_bark": "Блестящая кора",
  "item.enigmaticdelicacy.glistening_heart": "Сверкающее сердце защиты",
  "item.enigmaticdelicacy.gluttony_charm": "Эмблема безграничного чревоугодия",
  "item.enigmaticdelicacy.harmonious_grail": "Гармоничный Грааль",
  "item.enigmaticdelicacy.hungry_charm": "Амулет самодисциплины",
  "item.enigmaticdelicacy.ichor_egg": "Ихоровое яйцо",
  "item.enigmaticdelicacy.ichoroot_soup": "Суп из ихорокорня",
  "item.enigmaticdelicacy.passion_fried_rice": "Жареный рис страсти",
  "item.enigmaticdelicacy.purified_dragon_breath": "Очищенное дыхание дракона",
  "item.enigmaticdelicacy.sticky_pie_slice": "Кусок липкого загадочного пирога",
  "item.enigmaticdelicacy.stuffed_astral_potato": "Фаршированный астральный картофель",
  "item.enigmaticdelicacy.weapon_charm": "Слава мастера оружия",
  "itemGroup.enigmaticDelightCreativeTab": "§5Enigmatic Delicacy",
  "message.enigmaticdelicacy.cursed_sleep_with_tea": "Астральный чай успокаивает сердце, заставляя забыть о тревогах и страхах. Хотя эффект ограничен, наслаждайтесь спокойным сном этой ночью...",
  "tooltip.enigmaticdelicacy.CursedSoulCrystal1": "§5Содержит пойманные души.",
  "tooltip.enigmaticdelicacy.CursedSoulCrystal2": "§5Нельзя использовать напрямую.",
  "tooltip.enigmaticdelicacy.abyssStewBoost": "§5- Получите дополнительное §dСердце Бездны§5 после использования.",
  "tooltip.enigmaticdelicacy.abyssStewBoost_alt": "§5§m – Получите дополнительное §d§m Сердце Бездны§5§m после использования.",
  "tooltip.enigmaticdelicacy.abyssalStew1": "§5После употребления:",
  "tooltip.enigmaticdelicacy.abyssalStew2": "§5- Наносимый урон увеличивается на §6%1$s§5.",
  "tooltip.enigmaticdelicacy.abyssalStew3": "§5- Получаемый урон уменьшается на §6%1$s§5.",
  "tooltip.enigmaticdelicacy.abyssalStew4": "§5- Накладывает §6Порчу Бездны§5 при атаке.",
  "tooltip.enigmaticdelicacy.abyssalStew5": "§5- Дает §dУсиление Бездны§5.",
  "tooltip.enigmaticdelicacy.abyssalStew6": "§5Возвращает §6Сердце Бездны§5 после окончания эффекта.",
  "tooltip.enigmaticdelicacy.astralCruet": "§5В инвентаре: Питательность еды увеличивается на §6%1$s§5.",
  "tooltip.enigmaticdelicacy.astralPopsicle": "Иммунитет к огню (01:00)",
  "tooltip.enigmaticdelicacy.astralTea1": "§dИзменение §6Седьмого проклятия§d:",
  "tooltip.enigmaticdelicacy.astralTea2": "§d- Позволяет выпившему заснуть один раз",
  "tooltip.enigmaticdelicacy.balancedStewedSoupBlock": "§5Может временно подавить эффект §6Запретного плода§5.",
  "tooltip.enigmaticdelicacy.bloodyCustard": "§5Постоянный бонус к прочности брони и слабая регенерация.",
  "tooltip.enigmaticdelicacy.curseBlade1": "§6Shift + ПКМ§5, чтобы потратить здоровье и зарядить клинок.",
  "tooltip.enigmaticdelicacy.curseBlade2": "§5Атаки наносят вам дополнительный §6%1$s §5урон по здоровью.",
  "tooltip.enigmaticdelicacy.curseBlade3": "§5И временно уменьшают макс. здоровье цели на §6%1$s §5.",
  "tooltip.enigmaticdelicacy.curseBlade4": "§4Его можно использовать на пустой разделочной доске после зарядки.",
  "tooltip.enigmaticdelicacy.curseCrystalKnife1": "§5- Шанс §6%1$s§5 наложить §dПроклятие здоровья §5 при атаке.",
  "tooltip.enigmaticdelicacy.curseCrystalKnife2": "§5- Если у цели §dПроклятие здоровья V§5, оно поглощается и",
  "tooltip.enigmaticdelicacy.curseCrystalKnife3": "§6 наносит дополнительные §6 5% §5 чистого урона от макс. здоровья цели.",
  "tooltip.enigmaticdelicacy.curseCrystalKnife4": "§5- Урон плюс дополнительные §c%1$s§5 (§d%2$s§5/§d%3$s§5).",
  "tooltip.enigmaticdelicacy.curseCrystalKnife5": "§5ПКМ по некоторым существам превращает их в детей и выбивает добычу.",
  "tooltip.enigmaticdelicacy.curseCrystalKnifeCount": "§5- Убийств: §6%1$s",
  "tooltip.enigmaticdelicacy.curseCrystalPendant1": "§5- Восстанавливает §6%1$s§5 здоровья от каждого полученного удара.",
  "tooltip.enigmaticdelicacy.curseCrystalPendant2": "§5- Любое входящее лечение увеличивается на §6%1$s§5.",
  "tooltip.enigmaticdelicacy.curseCrystalPendant3": "§5- Чем ниже здоровье врага, тем меньше урона он вам наносит.",
  "tooltip.enigmaticdelicacy.curseCrystalPendant4": "§5- При получении смертельного урона тратит очки проклятия, чтобы",
  "tooltip.enigmaticdelicacy.curseCrystalPendant5": "§5 восстановить здоровье и наложить §dПроклятие здоровья§5.",
  "tooltip.enigmaticdelicacy.curseCrystalSoulAmount": "§c- Очки проклятия: §d%1$s",
  "tooltip.enigmaticdelicacy.curseCrystalSoulAmountPercent": "§c- Очки проклятия: §d%1$s§5 / §d%2$s",
  "tooltip.enigmaticdelicacy.cursePotion": "§5Снимает последнее проклятие жизни.",
  "tooltip.enigmaticdelicacy.divineFruitPie": "§5С некоторым шансом навсегда дает §6+1§d случайный слот §5.",
  "tooltip.enigmaticdelicacy.divineFruitPieBlock": "§5Не прикасайтесь опрометчиво к божественному пиру",
  "tooltip.enigmaticdelicacy.enchantmentDuplicator1": "§5Соедините с любым зачарованным предметом в сетке крафта.",
  "tooltip.enigmaticdelicacy.enchantmentDuplicator2": "§5Чтобы скопировать чары в этот фолиант.",
  "tooltip.enigmaticdelicacy.etheriumMachete": "§5Нажмите §6ПКМ§5, чтобы бросить нож.",
  "tooltip.enigmaticdelicacy.etheriumSteak": "§5Дает §dЭфириевый щит§5 (00:20)",
  "tooltip.enigmaticdelicacy.etheriumStoveFuel1": "§dЭфириевое топливо",
  "tooltip.enigmaticdelicacy.etheriumStoveFuel2": "§5 Обеспечивает вечное горение",
  "tooltip.enigmaticdelicacy.fadingScroll1": "§5Периодически дает эффект §6Затухания§5.",
  "tooltip.enigmaticdelicacy.fadingScroll2": "§5Перезарядка: §6%1$s§5с.",
  "tooltip.enigmaticdelicacy.glisteningHeart1": "§5Тратит прочность, чтобы отразить §6%1$s§5 полученного урона.",
  "tooltip.enigmaticdelicacy.glisteningHeart2": "§5Если разовый урон превышает §6%1$s§5 от текущего здоровья,",
  "tooltip.enigmaticdelicacy.glisteningHeart3": "§5тратит всю прочность, чтобы полностью поглотить этот урон.",
  "tooltip.enigmaticdelicacy.glisteningHeart4": "§5Перезарядка: §6%1$s§5с.",
  "tooltip.enigmaticdelicacy.gluttonyCharm2": "§6+%1$s §dКрит. урон",
  "tooltip.enigmaticdelicacy.gluttonyCharm5": "§5Эти характеристики зависят от процента",
  "tooltip.enigmaticdelicacy.gluttonyCharm6": "§5 недостающего вам запаса сытости.",
  "tooltip.enigmaticdelicacy.gluttonyCharm7": "§5Дает иммунитет к урону от голода.",
  "tooltip.enigmaticdelicacy.harmoniousGrail1": "§5Хотя это кажется неправильным,",
  "tooltip.enigmaticdelicacy.harmoniousGrail2": "§5выпить это определённо стоит.",
  "tooltip.enigmaticdelicacy.hungryCharm": "§5Усиливает голод в зависимости от его текущего значения.",
  "tooltip.enigmaticdelicacy.passionFriedRice": "§5Постоянный бонус к силе и скорости атаки.",
  "tooltip.enigmaticdelicacy.purifiedDragonBreath": "Переносит ваши эффекты на окружение",
  "tooltip.enigmaticdelicacy.stickyPie1": "§5Постоянный бонус к скорости и удаче.",
  "tooltip.enigmaticdelicacy.stickyPie2": "§5 Дает временный эффект.",
  "tooltip.enigmaticdelicacy.weaponCharm": "§5Улучшает возможности оружия в руке.",
  "tooltip.enigmaticdelicacy.wip": "§4Функция не завершена",
  "tooltip.enigmaticlegacy.desolationRingBoost1": "§5- §dРядом с вами больше не спавнятся существа§5.",
  "tooltip.enigmaticlegacy.desolationRingBoost2": "§5- §dСущества§5 больше не нападают на вас первыми.",
  "tooltip.enigmaticlegacy.eldritchAmuletBoost1": "§5- Накладывает мощную §dПорчу Бездны§5 на окружающих существ.",
  "tooltip.enigmaticlegacy.eldritchAmuletBoost2": "§5- Увеличивает урон на §6%1$s§5 по существам с малым запасом здоровья.",
  "tooltip.enigmaticlegacy.eldritchAmuletBoost3": "§5- Урон от существ с малым запасом здоровья снижен на §6%1$s§5.",
  "tooltip.enigmaticlegacy.eldritchAmuletStat1_alt": "§6+30% §dУрона в ближнем бою",
  "tooltip.enigmaticlegacy.theInfinitumBoost1": "§5- §6%1$s§5 сопротивление урону, пока предмет в руках.",
  "tooltip.enigmaticlegacy.theInfinitumBoost2": "§5- Дополнительный урон зависит от количества §dотрицательных эффектов§5 на цели."
}