{
  "name": "Улучшение Энергии (Energy Upgrade)",
  "category": "modularrouters:upgrades",
  "icon": "modularrouters:energy_upgrade",
  "pages": [
    {
      "type": "text",
      "text": "Это улучшение даёт маршрутизатору внутренний энергетический буфер. Каждое улучшение увеличивает размер буфера на 50 000 FE и скорость передачи на 1 000 FE за $(italic)тик маршрутизатора/$ (эти значения можно настроить в конфиге мода).$(p)Есть несколько сценариев, где улучшение Энергии полезно, которые описаны на следующих страницах."
    },
    {
      "type": "text",
      "title": "1. Передача энергии",
      "text": "Модули $(l:modules/energy_output)Energy Output/$ и $(l:modules/energy_distributor)Energy Distributor/$ могут активно передавать энергию из буфера маршрутизатора к соседним или близким блокам.$(p)С помощью этих модулей можно фактически создать энергетический блок с ограниченной возможностью беспроводной передачи энергии."
    },
    {
      "type": "text",
      "title": "2. Питание модулей",
      "text": "По умолчанию модули маршрутизатора не тратят энергию при работе, за исключением $(l:modules/activator)Activator Module/$ в режиме атаки.$(p)Однако использование энергии настраиваемо, и возможно, что в вашем мод-паке другие модули тоже будут потреблять энергию; все модули, где это применимо, показывают расход энергии в подсказке."
    },
    {
      "type": "text",
      "title": "3. Зарядка предметов",
      "text": "Любой предмет с энергией в буфере маршрутизатора может опционально получать энергию из внутреннего буфера маршрутизатора или отдавать её обратно.$(p)Если предмет с энергией находится в буфере, в GUI маршрутизатора появится переключаемая кнопка между буфером и индикатором энергии для установки направления передачи."
    },
    {
      "type": "text",
      "title": "Скорости передачи",
      "text": "Важно заметить, что указанные скорости передачи в подсказках указаны в FE за $(italic)тик маршрутизатора/$, что не то же самое, что FE/т. Скорость тика маршрутизатора зависит от $(l:upgrades/speed)Speed Upgrades/$; без улучшений скорости тик маршрутизатора происходит каждые 20 серверных тиков. Поэтому общая скорость передачи может быть ниже ожидаемой."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:energy_upgrade"
    }
  ]
}
