{
  "name": "Улучшение безопасности (Security Upgrade)",
  "category": "modularrouters:upgrades",
  "icon": "modularrouters:security_upgrade",
  "pages": [
    {
      "type": "text",
      "text": "$(thing)Security Upgrade/$ имеет несколько важных функций, описанных на следующих страницах."
    },
    {
      "type": "text",
      "title": "Защита",
      "text": "Маршрутизатор с установленным Security Upgrade $(italic)может/$ быть открыт только игроками, внесёнными в белый список этого улучшения. Улучшение не препятствует разрушению маршрутизатора; но так как улучшения и модули остаются внутри сломанного маршрутизатора, игроки не могут сломать его, чтобы украсть модули/улучшения или перенастроить маршрутизатор. Если вы хотите полностью защитить маршрутизатор от разрушения, стоит рассмотреть возможности защиты блоков из других модов."
    },
    {
      "type": "text",
      "title": "Фейковые игроки",
      "text": "Некоторые модули ($(l:modules/placer)Placer/$, $(l:modules/breaker)Breaker/$, $(l:modules/activator)Activator/$) выполняют свои действия как $(thing)фейковый игрок/$. По умолчанию это игрок с именем $(thing)[Modular Routers]/$, но с установленным Security Upgrade модули работают как владелец улучшения. Это гораздо безопаснее на серверах с защитой участков, чем позволять $(thing)[Modular Routers]/$ выполнять любые действия с вашими участками."
    },
    {
      "type": "text",
      "title": "Режим атаки Activator",
      "text": "Когда $(l:modules/activator)Activator Module/$ находится в $(thing)Режиме атаки/$, он будет игнорировать игроков, внесённых в белый список Security Upgrade, установленного в маршрутизаторе. Это обычно полезно, чтобы избежать случайного урона, если у маршрутизатора есть мощное оружие..."
    },
    {
      "type": "spotlight",
      "item": "modularrouters:override_card",
      "anchor": "override",
      "text": "$(li)Существует некрафтебельный предмет $(thing)Security Override Card/$ — его можно получить в творческом режиме или через чит (JEI и т.д.). Игрок, держащий его в любой руке, не подвергается действию Security Upgrade и может получить доступ к любому маршрутизатору."
    },
    {
      "type": "text",
      "text": "Вы можете добавить дополнительных игроков в Security Upgrade, $(thing)правый-клик/$ по игроку, держа улучшение в основной руке.$(p)Удалить игроков можно с помощью $(thing)сник-правый-клик/$ по игроку.$(p)Максимум 6 дополнительных игроков на одно улучшение (всего 7 с учётом создателя), но при необходимости можно установить несколько Security Upgrade в один маршрутизатор."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:security_upgrade"
    }
  ]
}
