{
  "name": "Улучшение синхронизации (Sync Upgrade)",
  "category": "modularrouters:upgrades",
  "icon": "modularrouters:sync_upgrade",
  "pages": [
    {
      "type": "text",
      "text": "Это улучшение используется для гарантии того, что два или более маршрутизаторов будут работать одновременно. У Sync Upgrade есть значение настройки от 0 до 19 (т.е. на 1 меньше базового интервала тика маршрутизатора 20). Это значение можно задать, $(thing)кликнув правой кнопкой/$ по улучшению для открытия его GUI, или быстро установить случайное значение, $(thing)зажав Shift и кликнув правой кнопкой/$."
    },
    {
      "type": "text",
      "text": "Любые маршрутизаторы с этим улучшением, с одинаковым значением настройки и с одинаковым количеством $(l:upgrades/speed)Speed Upgrades/$, всегда будут работать в один и тот же тик. Фактическое значение настройки не имеет значения; важно, чтобы оно было одинаковым для всех маршрутизаторов, которые нужно синхронизировать.$(p)Это особенно полезно, если у вас есть группа маршрутизаторов с $(l:modules/extruder_1)Extruder Modules/$ и вы хотите, чтобы все модули одновременно выдвигались и втягивались."
    },
    {
      "type": "text",
      "text": "Продвинутые заметки #1: значение настройки Sync Upgrade фактически определяет точный момент, когда маршрутизатор будет работать относительно его интервала тика. Например, по умолчанию маршрутизаторы тикают каждые 20 серверных тиков; Sync Upgrade с настройкой 15 гарантирует, что маршрутизатор $(italic)всегда/$ работает через 15 тиков после этого, и это применимо ко $(italic)всем/$ маршрутизаторам с настройкой 15. А улучшение с настройкой 16 всегда срабатывает на 1 тик позже, чем 15-настроенное, по крайней мере для маршрутизаторов с одинаковым количеством $(l:upgrades/speed)Speed Upgrades/$..."
    },
    {
      "type": "text",
      "text": "Продвинутые заметки #2: так как $(l:upgrades/speed)Speed Upgrades/$ заставляют маршрутизаторы тикать чаще, это влияет на работу Sync Upgrade. Маршрутизатор с 9 Speed Upgrades тикает каждые 2 серверных тика (вместо 20). Для Sync Upgrade в таком маршрутизаторе важно только, четное или нечетное значение настройки; 2 (или 4/6/8…) тика позже фактически то же самое, что 0 тиков позже! В общем случае: значение настройки рассчитывается по модулю фактического интервала тика маршрутизатора после учета Speed Upgrades."
    },
    {
      "type": "crafting",
      "recipe": "modularrouters:sync_upgrade"
    }
  ]
}

