{
  "name": "Teleposers",
  "icon": "bloodmagic:teleposerfocus",
  "category": "bloodmagic:utility",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "$(item)Teleposers$() позволяют использовать форму $(fire)Redstone Controlled$() телепортации. Просто создайте $(item)Teleposition Focus$() (на обороте), привяжите его к целевому телепозеру, поместите в другой телепозер и примените сигнал красного камня к телепозеру с фокусом в нем. Все — блоки, предметы, сущности, игроки — в определенной области над двумя телепозерами будет заменено местами."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "bloodmagic:teleposer",
      "text": "Однако ничто не приходит бесплатно; транспортировка блоков или объектов через телепозер будет стоить $(blood)1 LP$() каждый за каждые два пройденных блока, максимум до $(blood)1000 LP$() за блок/объект или $(blood)10000 LP$() в общей сложности."
    },
    {
      "type": "bloodmagic:crafting_altar",
      "heading": "Телепозиционный фокус",
      "recipe": "bloodmagic:altar/teleposer_focus",
      "text": "Базовый $(item)Teleposer Focus$() поменяет местами все, что находится в области блока 1x1x1 над двумя телепозерами."
    },
    {
      "type": "bloodmagic:crafting_altar",
      "heading": "Улучшенный фокус",
      "recipe": "bloodmagic:altar/enhanced_teleposer_focus",
      "text": "$(item)Enhanced Teleposer Focus$() поменяет местами все, что находится в области блока 3x3x3, расположенной непосредственно над двумя телепозерами."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "bloodmagic:enhanced_teleposer_focus",
      "text": "$(item)Reinforced Teleposer Focus$() поменяет местами что угодно в области блока 5x5x5, расположенной непосредственно над двумя телепозерами."
    },
    {
      "type": "patchouli:text",
      "text": "Телепозеры могут быть связаны в одну сторону (так, что сигнал красного камня выходящему телепозеру ничего не делает), двустороннее (так, что в каждом телепозере есть фокус, связанный с другим телепозером, что заставляет вас телепортироваться взад и вперед по сигналу красного камня с любого конца), или они могут даже быть связаны цепочкой - от A к B к C и обратно к A. От систем лифтов, перемещающихся по базе, до сложных подземных лабиринтов, сходите с ума!"
    },
    {
      "type": "patchouli:text",
      "text": "Если у вас возникли трудности с запуском Teleposer, убедитесь, что он $(thing)сильно работает на основе красного камня$(). Это означает, что размещение блока красного камня рядом с блоком не приведет к его включению — вам понадобится красная пыль, или повторитель, направленный в сторону телепозера, или рычаг или кнопка непосредственно на нем. В конце концов, Life Essense не бесплатна, поэтому Teleposer предназначен для минимизации случайных осечек. Для получения дополнительной информации о сильной и слабой силе красного камня посетите $(l:https://minecraft.fandom.com/wiki/Redstone_mechanics?oldid\u003d2127827#Powered_vs._activated)Minecraft Wiki.$()"
    }
  ]
}