{
  "name": "Космическая станция",
  "icon": "ad_astra:/textures/gui/sprites/space_station.png",
  "sortnum": 0,
  "category": "ad_astra:the_moon",
  "pages": [
    {
      "type": "patchouli:text",
      "title": "Космическая станция",
      "text": "Космическая станция — это готовая структура, которая создаётся на экране выбора планет при наличии необходимых материалов. Станции всегда располагаются на орбите луны или планеты и дают возможность размещать блоки в этом орбитальном измерении."
    },
    {
      "type": "patchouli:text",
      "title": "Космическая станция",
      "text": "Космические станции спроектированы с расчётом на расширение, что позволяет вам построить базу своей мечты прямо над планетой. Все ваши станции отображаются на экране планет. Другие игроки не могут создавать свои станции в той же области, где находится ваша, так что ваша постройка в безопасности."
    },
    {
      "type": "patchouli:text",
      "title": "Движение в космосе",
      "text": "Физика в космосе сильно отличается от земной. В условиях нулевой гравитации вы будете парить, не подвергаясь воздействию притяжения или трения. Это может затруднить передвижение. Один из полезных инструментов — пневматический пистолет (Zip Gun). Он потребляет кислород, чтобы толкать вас вперёд. Будьте осторожны со скоростью: из-за отсутствия трения вы можете улететь слишком далеко и потеряться."
    },
    {
      "type": "patchouli:crafting",
      "title": "Пневматический пистолет",
      "recipe": "ad_astra:zip_gun"
    },
    {
      "type": "patchouli:text",
      "title": "Cadmus",
      "text": "Если установлен мод $(l:https://modrinth.com/mod/cadmus)Cadmus$(/l), чанки 3x3 на вашей космической станции будут автоматически запривачены. Кроме того, другие игроки не смогут создавать новые станции в пределах ваших заявленных чанков."
    },
    {
      "type": "patchouli:text",
      "title": "Argonauts",
      "text": "Если установлен мод $(l:https://modrinth.com/mod/argonauts)Argonauts$(/l), другие игроки из вашей группы или гильдии смогут приземляться на вашей космической станции, а вы — на их станциях."
    }
  ]
}