{
  "sodium.console.broken_nvidia_driver": "Ваши драйверы NVIDIA устарели!\n  * Это вызовет серьёзные проблемы с производительностью и сбои при установленном Sodium.\n  * Пожалуйста, обновите драйверы до последней версии (536.23 или новее).",
  "sodium.console.core_shaders_error": "Следующие ресурс-паки несовместимы с Sodium:",
  "sodium.console.core_shaders_info": "Проверьте журнал игры для подробной информации.",
  "sodium.console.core_shaders_warn": "Следующие ресурс-паки могут быть несовместимы с Sodium:",
  "sodium.console.game_restart": "Для применения одного или нескольких видео-настроек требуется перезапустить игру!",
  "sodium.console.pojav_launcher": "PojavLauncher не поддерживается при использовании Sodium.\n  * Скорее всего, вы столкнётесь с серьёзными проблемами с производительностью, графическими багами и сбоями.\n  * Если вы решите продолжить — мы не сможем помочь с багами или сбоями!",
  "sodium.option_impact.extreme": "Экстремальное",
  "sodium.option_impact.high": "Высокое",
  "sodium.option_impact.low": "Низкое",
  "sodium.option_impact.medium": "Среднее",
  "sodium.option_impact.varies": "Варьируется",
  "sodium.options.always_defer_chunk_updates.name": "Всегда откладывать обновление чанков",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если включено, рендеринг никогда не будет ждать завершения обновления чанков, даже если это важно. Это может значительно повысить FPS в некоторых случаях, но приведёт к задержкам появления/исчезновения блоков.",
  "sodium.options.animate_only_visible_textures.name": "Анимировать только видимые текстуры",
  "sodium.options.animate_only_visible_textures.tooltip": "Если включено, будут обновляться только те анимированные текстуры, которые видимы на экране. Это может значительно повысить производительность на некоторых устройствах, особенно с тяжёлыми ресурс-паками. Если некоторые текстуры перестали анимироваться — попробуйте отключить эту опцию.",
  "sodium.options.attack_indicator.tooltip": "Определяет, где на экране отображается индикатор атаки.",
  "sodium.options.autosave_indicator.tooltip": "Если включено, будет отображаться индикатор при автосохранении мира на диск.",
  "sodium.options.biome_blend.tooltip": "Расстояние (в блоках), на котором цвета биомов плавно смешиваются. Большие значения значительно увеличивают время загрузки/обновления чанков, но качество улучшается незначительно.",
  "sodium.options.biome_blend.value": "%s блок(ов)",
  "sodium.options.brightness.tooltip": "Регулирует яркость (гамму) игры.",
  "sodium.options.buttons.apply": "Применить",
  "sodium.options.buttons.donate": "Купите нам кофе!",
  "sodium.options.buttons.undo": "Отменить",
  "sodium.options.chunk_update_threads.name": "Потоки обновления чанков",
  "sodium.options.chunk_update_threads.tooltip": "Указывает количество потоков для построения чанков. Большее количество ускоряет загрузку и обновление чанков, но может негативно сказаться на стабильности кадров. Обычно значение по умолчанию подходит для всех случаев.",
  "sodium.options.clouds_quality.tooltip": "Качество облаков в небе. Несмотря на названия \"Быстро\" и \"Красиво\", влияние на производительность минимально.",
  "sodium.options.cpu_render_ahead_limit.name": "Ограничение опережающего рендера CPU",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Только для отладки. Определяет максимальное количество кадров, которые могут быть подготовлены для GPU. Изменять не рекомендуется: слишком низкие или высокие значения могут вызвать нестабильность FPS.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(ов)",
  "sodium.options.entity_distance.tooltip": "Множитель дальности прорисовки для сущностей. Меньше — сущности видны ближе, больше — дальше.",
  "sodium.options.entity_shadows.tooltip": "Если включено, под мобами и другими сущностями будут отображаться простые тени.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может снизить энергопотребление и нагрузку на систему при многозадачности. Если включён VSync, этот параметр будет проигнорирован, если не ниже частоты обновления экрана.",
  "sodium.options.fullscreen.tooltip": "Если включено, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "sodium.options.graphics_quality.tooltip": "Стандартное качество графики управляет некоторыми устаревшими опциями и необходимо для совместимости с модами. Если параметры ниже оставлены на \"По умолчанию\", будет использоваться это значение.",
  "sodium.options.gui_scale.tooltip": "Устанавливает максимальный масштаб интерфейса. Если выбран \"авто\", всегда будет использоваться наибольший возможный масштаб.",
  "sodium.options.leaves_quality.name": "Листва",
  "sodium.options.leaves_quality.tooltip": "Определяет, будет ли листва отображаться прозрачной (красиво) или непрозрачной (быстро).",
  "sodium.options.mipmap_levels.tooltip": "Определяет количество уровней mip-карт для текстур блоков. Большее значение улучшает отображение блоков вдали, но может снизить производительность с ресурс-паками с множеством анимированных текстур.",
  "sodium.options.pages.advanced": "Дополнительно",
  "sodium.options.pages.performance": "Производительность",
  "sodium.options.pages.quality": "Качество",
  "sodium.options.particle_quality.tooltip": "Ограничивает максимальное количество частиц, одновременно отображаемых на экране.",
  "sodium.options.performance_impact_string": "Влияние на производительность: %s",
  "sodium.options.simulation_distance.tooltip": "Дистанция симуляции определяет, на каком расстоянии блоки и сущности будут загружаться и обновляться. Меньшая дистанция снижает нагрузку на внутренний сервер и может повысить FPS.",
  "sodium.options.smooth_lighting.tooltip": "Включает плавное освещение и затенение блоков. Может незначительно увеличить время загрузки или обновления чанка, но не влияет на FPS.",
  "sodium.options.translucent_face_sorting.name": "Сортировка прозрачных граней",
  "sodium.options.translucent_face_sorting.tooltip": "Если включено, прозрачные эффекты для таких поверхностей, как окрашенное стекло и вода, будут отображаться корректно.",
  "sodium.options.use_block_face_culling.name": "Использовать отсечение граней блоков",
  "sodium.options.use_block_face_culling.tooltip": "Если включено, для рендера будут отправляться только те грани блоков, которые видны с камеры. Это позволяет значительно ускорить рендеринг. Некоторые ресурс-паки могут работать некорректно с этой опцией — отключите, если видите дыры в блоках.",
  "sodium.options.use_compact_vertex_format.name": "Компактный формат вершин",
  "sodium.options.use_compact_vertex_format.tooltip": "Если включено, для рендеринга чанков будет использоваться более компактный формат вершин. Это может значительно снизить использование видеопамяти и требования к пропускной способности, особенно на встроенной графике, но может вызвать мерцание (z-fighting) с некоторыми ресурс-паками из-за снижения точности координат позиции и текстуры. Отключение этой опции не влияет, если установлен Oculus.",
  "sodium.options.use_entity_culling.name": "Использовать отсечение сущностей",
  "sodium.options.use_entity_culling.tooltip": "Если включено, сущности, находящиеся в области видимости камеры, но вне видимых чанков, не будут рендериться. Эта оптимизация использует уже существующие данные видимости и не добавляет нагрузки.",
  "sodium.options.use_fog_occlusion.name": "Использовать окклюзию туманом",
  "sodium.options.use_fog_occlusion.tooltip": "Если включено, чанки, полностью скрытые туманом, не будут рендериться, что повышает производительность. Эффект заметнее при густом тумане (например, под водой), но может вызвать визуальные артефакты между небом и туманом.",
  "sodium.options.use_no_error_context.name": "Использовать контекст без ошибок",
  "sodium.options.use_no_error_context.tooltip": "Если включено, OpenGL-контекст будет создан без проверки ошибок. Это немного повышает производительность, но затрудняет отладку неожиданных сбоев.",
  "sodium.options.use_persistent_mapping.name": "Использовать постоянное отображение памяти",
  "sodium.options.use_persistent_mapping.tooltip": "Только для отладки. Если включено, для staging-буфера будет использоваться постоянное отображение памяти, чтобы избежать лишних копирований. Отключение может помочь найти причину графических артефактов.\n\nТребуется OpenGL 4.4 или ARB_buffer_storage.",
  "sodium.options.v_sync.tooltip": "Если включено, частота кадров будет синхронизирована с частотой обновления монитора, что делает игру плавнее, но может увеличить задержку ввода. Может снизить производительность на слабых системах.",
  "sodium.options.view_bobbing.tooltip": "Если включено, камера будет покачиваться при движении. Игрокам, страдающим от укачивания, рекомендуется отключить.",
  "sodium.options.view_distance.tooltip": "Дальность прорисовки определяет, на каком расстоянии будет отображаться ландшафт. Меньшая дальность — меньше загруженной территории, выше FPS.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если включено, при нахождении игрока в тёмных местах будет применяться эффект виньетки, затемняя изображение и делая его более драматичным.",
  "sodium.options.weather_quality.tooltip": "Определяет расстояние, на котором будут отображаться погодные эффекты, такие как дождь и снег."
}