{
  "name": "Типы пушек",
  "icon": "terramity:pump_action_shotgun",
  "category": "terramity:guns",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "В Terramity существует множество различных типов пушек, которые сильно различаются по своим функциям и назначению. Они варьируются от миниганов, дробовиков до рельсы."
    },
    {
      "type": "patchouli:spotlight",
      "text": "Пистолеты в Terramity обычно имеют много патронов в магазине, наносят значительный урон и иногда могут быть одноручными, что позволяет использовать оружие ближнего боя и пистолет одновременно!",
      "item": {
        "item": "terramity:basic_pistol"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Полуавтоматические винтовки в Terramity имеют большую дальность стрельбы, стреляют с приличной скоростью и наносят солидный урон.",
      "item": {
        "item": "terramity:basic_rifle"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Снайперские винтовки в Terramity обладают невероятно большой дальностью стрельбы, малым разбросом, наносят высокий урон, но иногда требуют дорогостоящих боеприпасов и много времени на перезарядку.",
      "item": {
        "item": "terramity:elite_rifle"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Автоматические пушки в Terramity имеют большую дальность стрельбы и наносят огромный урон, но стрельба может иметь большой разброс и быть дорогой.",
      "item": {
        "item": "terramity:advanced_automatic_rifle"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Дробовики в Terramity очень мощные, с сильной отдачей, но имеют малую дальность поражения.",
      "item": {
        "item": "terramity:pump_action_shotgun"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Пушки типа Рельса в Terramity чрезвычайно мощны, имеют функцию сканирования попаданий и не используют боеприпасы. В отличие от обычных пушек, в пушках типа рельса используется система подзарядки, поэтому хорошей идеей может быть всегда иметь их под рукой на случай чрезвычайной ситуации.",
      "item": {
        "item": "terramity:railgun"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Ракетомёты в Terramity хороши для уничтожения больших волн врагов одновременно, когда вас не беспокоит местность, по которой вы стреляете.",
      "item": {
        "item": "terramity:rocket_launcher"
      }
    },
    {
      "type": "patchouli:spotlight",
      "text": "Есть пушки, которые не попадают ни в одну конкретную категорию, но все же функционируют как пушки.",
      "item": {
        "item": "terramity:flare_gun"
      }
    }
  ]
}