{
  "name": "Улучшения конвейера",
  "icon": "industrialforegoing:conveyor_extraction_upgrade",
  "category": "industrialforegoing:transport",
  "sortnum": 1,
  "read_by_default": true,
  "pages": [
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_extraction_upgrade",
      "title": "Извлечение",
      "text": "Извлекает предметы и жидкости из инвентарей. Оно также может забирать предметы из инвентаря игрока. $(br2)Предметы и жидкости для извлечения можно настроить в фильтре через интерфейс."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_insertion_upgrade",
      "title": "Вставка",
      "text": "Помещает предметы и жидкости в инвентари. Имеет 2 режима: вставка предметов, касающихся конвейера, или вставка предметов, которые напрямую касаются самого улучшения. $(br2)Настройки фильтрации доступны в интерфейсе."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_detection_upgrade",
      "title": "Детектор",
      "text": "Обнаруживает предметы и существ, находящихся на конвейере. $(br2)Объекты для обнаружения настраиваются в интерфейсе. Существ можно фильтровать с помощью MIB, внутри которого находится нужное существо."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_bouncing_upgrade",
      "title": "Прыжок",
      "text": "Подбрасывает предметы и существ на конвейере. Вертикальную и горизонтальную силу толчка можно настроить в интерфейсе. $(br2)Объекты для запуска настраиваются через фильтр. Существ можно фильтровать с помощью MIB."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_dropping_upgrade",
      "title": "Сброс",
      "text": "Сбрасывает предметы и существ с конвейера прямо под него. $(br2)Фильтрация сбрасываемых объектов настраивается в интерфейсе. Существ можно фильтровать с помощью MIB."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_blinking_upgrade",
      "title": "Мерцание",
      "text": "Телепортирует предметы и существ на конвейере. Дистанцию телепортации по вертикали и горизонтали можно изменить в интерфейсе. $(br2)Объекты для перемещения настраиваются в интерфейсе. Существ можно фильтровать с помощью MIB."
    },
    {
      "type": "spotlight",
      "item": "industrialforegoing:conveyor_splitting_upgrade",
      "title": "Разделение",
      "text": "Разделяет потоки предметов и существ на конвейере в соотношении, указанном в интерфейсе. Для корректной работы требуются улучшения на всех сторонах, по которым нужно распределить ресурсы."
    }
  ]
}